SIFCommons/resources/messages/SOAP/event.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:To>https://AcmeHost:443/StudentAdmin</wsa:To>
    <wsa:From>
      <wsa:Address>https://AcmeHost:443/ZoneControl</wsa:Address>
    </wsa:From>
    <wsa:MessageID>fe886483-0132-1000-0003-002500f11f4e</wsa:MessageID>
    <wsa:Action>http://www.sifassociation.org/contract/DataModel-S11/2.x/DataModel/PostEvent</wsa:Action>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:FaultTo>
    <SIFHeader xmlns="http://www.sifassociation.org/transport/soap/2.x" soap:mustUnderstand="1">
      <Timestamp>2010-10-24T15:58:33.984Z</Timestamp>
      <ZoneId>urn:sif:zone:AcmeMiddleSchool1.CoyoteDistrict.Arizona.US</ZoneId>
      <InfrastructureVersion>2.5</InfrastructureVersion>
      <DataModel>http://www.sifinfo.org/infrastructure/2.x</DataModel>
      <DataModelVersion>2.5</DataModelVersion>
      <Security>
        <SecureChannel>
          <AuthenticationLevel>3</AuthenticationLevel>
          <EncryptionLevel>4</EncryptionLevel>
        </SecureChannel>
      </Security>
      <SourceId>RamseySIS</SourceId>
      <DestinationId>StudentAdmin</DestinationId>
      <TopicName>StudentPersonal</TopicName>
      <EventAction>Change</EventAction>
    </SIFHeader>
  </soap:Header>
  <soap:Body>
    <Event xmlns="http://www.sifassociation.org/message/soap/2.x">  <!-- See the type, subtype, and namespace!!! -->
      <StudentPersonal xmlns="http://www.sifinfo.org/infrastructure/2.x" RefId="25DA0E9DE36DFBC52616985D9638EA06">
        <LocalId>@pKPv|*</LocalId>
        <Name Type="04">
          <LastName>iwcE?O</LastName>
          <FirstName>Zvj(SWgpQUy</FirstName>
        </Name>
      </StudentPersonal>
    </Event>
  </soap:Body>
</soap:Envelope>